; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	infrared4 - mode
	image1 - mode
	image2 - mode
	thermograph0 - mode
	Star3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star6 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument2 image2)
	(supports instrument2 image3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(supports instrument3 image3)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument4 image1)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image3)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(have_image Planet8 infrared4)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 thermograph0)
	(have_image Star12 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation1 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 5
2. (turn_to satellite1 groundstation7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation7)
   goals met: 0 of 5
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
4. (calibrate satellite1 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 0 of 5
5. (turn_to satellite1 phenomenon11 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon11)
   goals met: 0 of 5
6. (take_image satellite1 phenomenon11 instrument2 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 1 of 5
7. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 5
8. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 5
9. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 1 of 5
10. (take_image satellite1 phenomenon10 instrument2 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 2 of 5
11. (turn_to satellite1 phenomenon9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 5
12. (take_image satellite1 phenomenon9 instrument2 image2)
   added: (have_image phenomenon9 image2)
   goals met: 3 of 5
13. (turn_to satellite1 star12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star12)
   goals met: 3 of 5
14. (take_image satellite1 star12 instrument2 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 4 of 5
15. (turn_to satellite2 planet8 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet8)
   goals met: 4 of 5
16. (take_image satellite2 planet8 instrument4 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 5 of 5
